import { Button, ScrollView, View } from "react-native";
import { useRef, useState } from "react";
import NoteBox from "@/components/noteBox/noteBox";
import HomeBottomSheet from "@/components/homeBottomSheet";
import BottomSheet from "@gorhom/bottom-sheet";
import { GestureHandlerRootView } from "react-native-gesture-handler";

const index = () => {
  const [noteTitle, setNoteTitle] = useState<string>("");
  const [notePara, setNotePara] = useState<string>("");
  const [grid, setGrid] = useState<boolean>(false);

  const bottomSheetRef = useRef<BottomSheet>(null);

  return (
    <GestureHandlerRootView>
      <View
        style={{
          flex: 1,
          alignItems: "center",
          justifyContent: "center",
          backgroundColor: "white",
          paddingHorizontal: 10,
        }}
      >
        {/* Main Content */}
        <ScrollView
          contentContainerStyle={{ paddingVertical: 10 }}
          style={{ width: "100%" }}
        >
          <View
            style={{
              flex: 1,
              alignItems: "center",
              paddingBottom: "18%",
              flexDirection: "row",
              alignContent: "center",
              flexWrap: "wrap",
              gap: 4,
              direction: "rtl",
            }}
          >
            <NoteBox
              grid={grid}
              title="بهشت"
              mainContent="
       
از اونجایی که یادمه
همه فقط خواستن برن بهشت
هیشکی نخواسته بسازه بهشت
پس نتیجه چی میشه؟
[کورس]
تو بگو بهشت کدومه؟
اصاً توو این زمین بهشت کجا بود
ما چه بیخیال و ساده بودیم بهمون
هر چی گفتن که اشتباه بود
تو بگو بهشت چی شدش
اینجا هر کی مُرد که رفتش زیرِ خاک
تو بگو عشق یعنی چی چی؟
ما که دیدم بالاخره میره هر عشقی به *
تو بگو بهشت کدومه؟
اصاً توو این زمین بهشت کجا بود
ما چه بیخیال و ساده بودیم بهمون
هر چی گفتن که اشتباه بود
تو بگو بهشت چی شدش
اینجا هر کی مُرد که رفتش زیرِ خاک
تو بگو عشق یعنی چی چی؟
ما که دیدم بالاخره میره هر عشقی به *
[ورس یک]
آآ، همه بی مصرف و مفت خور و کودن و یه مشت گاو دورِ من
همه چشما کثیفه و سرِ همسرت هم
هم جا چادرِ غم، بینِ این همه زخم و لاشخور *
تو هم دوس داری یه زن، * ماچ کنه نه؟
همه فکرا *، هر کی همین سرِ شب اومده نشده صبح میره
همین فرمون بری بدون همین فردا هم پس دیره
پس یه کم اینجا بمونی میبینی کلاً نفس میره
همه جمعا نفس گیره، همه درا بی دستگیره
تازه اگه دری باشه اصاً، کمپلت بن بست و زنجیره
همه قاطی هم، جک و * دزد و دلسوز
سوبر و مست و همشیره
حاجی بالای منبر * میکوبه بوشو بر میداره
آمریکا اوباما میاد، عمو من یه کمی بیشتر از ردی ام
تو خب ور نرو با ما زیاد
همه وحشی ولی بزدل توو این وضعیت
امام زمان هم پس میده کارما بیاد، هه
[کورس]
تو بگو بهشت کدومه؟
اصاً توو این زمین بهشت کجا بود
ما چه بیخیال و ساده بودیم بهمون
هر چی گفتن که اشتباه بود
تو بگو بهشت چی شدش
اینجا هر کی مُرد که رفتش زیرِ خاک
تو بگو عشق یعنی چی چی؟
ما که دیدم بالاخره میره هر عشقی به *
تو بگو بهشت کدومه؟
اصاً توو این زمین بهشت کجا بود
ما چه بیخیال و ساده بودیم بهمون
هر چی گفتن که اشتباه بود
تو بگو بهشت چی شدش
اینجا هر کی مُرد که رفتش زیرِ خاک
تو بگو عشق یعنی چی چی؟
ما که دیدم بالاخره میره هر عشقی به *
[ورس دو]
من خسته ام از جماعت زنده کُش مُرده پرست
خسته ام از این دلی که خورده ترک
خسته ام از اون حسی که اون با خودش بُرد به درک
خسته ام از حرفِ الکی بدون فکر و هدف، بدون عمل
خسته از اینهمه تضاهر به عشق، به دروغ قسم
از آدما و جای شلوغ
رو شیشه “ها” کردم نوشتم که طبیعت هوشمنده
مثلا اونی که گرگه پس فردا میبینه حالا بچه خودش گوسفنده
مثلاً شکارچیه میبینه یهو جفت خودشو پوست کنده
زمین جوری میچرخه که بریزه پوزخندت
از بالا نگاه کردی منو آره * بغض تو رو هم میبینم
عمو تو تانک سوار شو یه روزی دُم تو رو هم میچینن
من که سگ خور هزار بار شدم یه بار بالا
مرحله ی گربه خور هم میشینم
یه سریا هم اگه توبه کنن میمیرن
منم از اینا گاهی دورِ خودم میچینم
اینا خنده ان ولی سرفه کنم *
[بریج]
منتظرم بارون بیاد، توو روز بارونی برم دیپ تره
الهی که بعدِ من خوشی و خنده از این اکیپ نره
منتظرم تاریک بشه، توو شب و تاریکی برم خوف تره
الهی که بعدِ من دین و ایمونت سمت کفر نره
[ورس سه]
منو ول کن با شبم، تاریکه اما چقد آزاد و رهام
بذار من از اعتیاد تو درام، رفتنی باید بره تو نکن گریه برام
چقده خونِ دل و دردِ زیاد، تا که فهمیدم خودمو هیچ موقع به کم ندم
چقده رد شدم از گشنگی و سیر از همه
منِ خسته چه بَر و بازویی به هم زدم
[کورس]
تو بگو بهشت کدومه؟
اصاً توو این زمین بهشت کجا بود
ما چه بیخیال و ساده بودیم بهمون
هر چی گفتن که اشتباه بود
تو بگو بهشت چی شدش
اینجا هر کی مُرد که رفتش زیرِ خاک
تو بگو عشق یعنی چی چی؟
ما که دیدم بالاخره میره هر عشقی به *
تو بگو بهشت کدومه؟
اصاً توو این زمین بهشت کجا بود
ما چه بیخیال و ساده بودیم بهمون
هر چی گفتن که اشتباه بود
تو بگو بهشت چی شدش
اینجا هر کی مُرد که رفتش زیرِ خاک
تو بگو عشق یعنی چی چی؟
ما که دیدم بالاخره میره هر عشقی به *
متن آهنگ امیر تتلو به نام بهشت
              "
            />
            <NoteBox
              grid={grid}
              title="مصاحبه"
              mainContent="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می "
            />
            <NoteBox
              grid={grid}
              title="مصاحبه"
              mainContent="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می "
            />
            <NoteBox
              grid={grid}
              title="مصاحبه"
              mainContent="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجلو با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوو با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوه در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می "
            />
          </View>
        </ScrollView>

        <HomeBottomSheet
          bottomSheetRef={bottomSheetRef}
          noteTitle={noteTitle}
          setNoteTitle={setNoteTitle}
          setNotePara={setNotePara}
          notePara={notePara}
        />
      </View>
    </GestureHandlerRootView>
  );
};

export default index;
